[
	{
		"title": "Krzywe Karty",
		"image": "/images/CrookedCards.png",
		"scope": "PERSONAL",
		"short_description": "Multiplayer strategic card game",
		"description": [
			"Multiplayer turn-based strategic card game where each card has several complex abilities.",
			"Player's goal is to either conquer opponent's base or eliminate all of their cards.",
			"The game is based on a board game developed by my friend."
		],
		"focus_points": [
			"Uses Gameplay Framework to create a turn-based game as well as Gameplay Ability System for character abilities.",
			"Implemented complex attack system using component-based approach, that allows character to bind to different stages & scenarios of the attack.",
			"Created elegant solution for gameboard management and querying with the use of InstancedStructs and Gameplay Tags."
		],
		"technologies": [
			{
				"name": "Unreal Engine 5",
				"icon": "/icons/unreal-engine.svg"
			},
			{
				"name": "C++",
				"icon": "/icons/cpp.svg"
			}
		],
		"links": [
			{
				"name": "GitHub",
				"icon": "/icons/github.svg",
				"url": "https://github.com/Bartasus1/CrookedCards"
			},
			{
				"name": "Itch.io",
				"icon": "/icons/itch-io.svg",
				"url": "https://bartasus1.itch.io/krzywe-karty/download/9Sc2bvmDh9CR3fQUhWmbddVfOS1raOG9hiL6aNGI"
			}
		]
	},
	{
		"title": "Andromeda",
		"image": "/images/Andromeda.png",
		"scope": "PERSONAL",
		"short_description": "A prototype of an Action-Adventure RPG game",
		"description": [
			"The game me & my friends developed during our last semester at university of Wroclaw.",
			"Our goal was to make a prototype of an Action-Adventure RPG for the narrative we came up with (watch the video).",
			"We had a lot of fun working on it, and we learned a lot about game development and project management.",
			"Me personally, were responsible for the coordination of the project, as well as the programming most important parts of the game."
		],
		"focus_points": [
			"Complex and dynamic inventory & equipment system with drag & drop functionality.",
			"Advanced attack system with combo attacks and special abilities also depending on the weapon type.",
			"Simple but effective AI system with different types of enemies."
		],
		"technologies": [
			{
				"name": "Unreal Engine 5",
				"icon": "/icons/unreal-engine.svg"
			},
			{
				"name": "C++",
				"icon": "/icons/cpp.svg"
			}
		],
		"links": [
			{
				"name": "YouTube",
				"icon": "/icons/youtube.svg",
				"url": "https://www.youtube.com/watch?v=w7NvI6eKasY"
			}
		]
	},
	{
		"title": "Coco Jumpo",
		"image": "/images/CocoJumpo.jpg",
		"scope": "PERSONAL",
		"short_description": "A fast-paced vertical platformer",
		"description": [
			"A game developed during Hackathon 2020 with my friends. We had 48 hours to create this game.",
			"We were inspired by the game of our childhood - IcyTower.",
			"I was responsible for developing the levels and programming procedural generation of the platforms."
		],
		"focus_points": [
			"Procedural generation of the platforms, each fitting like a puzzle piece.",
			"Dynamic camera system that follows the player and speeds up depending on the traveled distance.",
			"Different obstacles and power-ups that diversify the gameplay."
		],
		"technologies": [
			{
				"name": "Unity Engine",
				"icon": "/icons/unity.svg"
			},
			{
				"name": "C++",
				"icon": "/icons/csharp.svg"
			}
		],
		"links": [
			{
				"name": "YouTube",
				"icon": "/icons/youtube.svg",
				"url": "https://www.youtube.com/watch?v=mSn-LewtKOs"
			}
		]
	},
	{
		"title": "Procedural terrain generator",
		"image": "/images/Terrain.png",
		"scope": "PERSONAL",
		"short_description": "A tool for procedural terrain generation in Unreal Engine",
		"description": [
			"Tool for procedural terrain generation in UE5 developed as a part of my engineer degree.",
			"Uses for Unreal's built-in Landscape actor and allows to specify a list of modifiers that modify its heightmap.",
			"Comes with two ready modifiers: Perlin Noise and Radial FadeOut.",
			"I used them both to create an island visible on the screenshot."
		],
		"focus_points": [
			"Works on Unreal's built-it Landscape actor by attaching a component with a list of modifiers.",
			"Built-in modifiers like Perlin Noise and Radial FadeOut, but system is extensible and allows to create custom modifiers."
		],
		"technologies": [
			{
				"name": "Unreal Engine 5",
				"icon": "/icons/unreal-engine.svg"
			},
			{
				"name": "C++",
				"icon": "/icons/cpp.svg"
			}
		],
		"links": [
			{
				"name": "GitHub",
				"icon": "/icons/github.svg",
				"url": "https://github.com/Bartasus1/LandmassGeneration"
			}
		]
	}
]